RT-Thread-packages/gd32-arm-series/GD32H77x_78x/GD32H77x_78x_standard_peripheral/Source/gd32h77x_78x_can.c
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_VALID_POINTER(can_parameter_init)) {
        fw_debug_report_err(CAN_MODULE_ID, API_ID(0x0003U), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* clear CAN RAM */
        for(i = 0U; i < CAN_MAX_RAM_SIZE; i++) {
            *((uint32_t *)canram) = 0U;
            canram = canram + 4U;
        }
        /* reset CAN_RFIFOMPFx */
        for(i = 0U; i < CAN_MAX_MAILBOX_NUM; i++) {
            CAN_RFIFOMPF(can_periph, i) = 0x00000000U;
        }

        /* reset internal state machines and CAN registers */
        if(ERROR == can_software_reset(can_periph)) {
            status = ERROR;
        } else {
            /* reset CAN_INTEN */
            CAN_INTEN(can_periph) = 0U;
            /* reset CAN_STAT */
            CAN_STAT(can_periph) = (uint32_t)0xFFFFFFFFU;
            CAN_TIMER(can_periph);
            while(CAN_STAT(can_periph) & CAN_STAT_MS5_RFNE) {
                CAN_STAT(can_periph) = CAN_STAT_MS5_RFNE;
            }

            /* clear register bits */
            CAN_CTL0(can_periph) &= ~(CAN_CTL0_RFEN | CAN_CTL0_FDEN | CAN_CTL0_SRDIS | CAN_CTL0_LAPRIOEN | CAN_CTL0_MST | CAN_CTL0_RPFQEN | CAN_CTL0_MSZ);
            CAN_CTL2(can_periph) &= ~(CAN_CTL2_ITSRC | CAN_CTL2_IDERTR_RMF | CAN_CTL2_RRFRMS | CAN_CTL2_RFO | CAN_CTL2_EFDIS | CAN_CTL2_PREEN);
            CAN_CTL1(can_periph) &= ~CAN_CTL1_MTO;
            CAN_BT(can_periph) &= ~(CAN_BT_BAUDPSC | CAN_BT_SJW | CAN_BT_PTS | CAN_BT_PBS1 | CAN_BT_PBS2);

            /* set self reception */
            if((uint8_t)DISABLE == can_parameter_init->self_reception) {
                CAN_CTL0(can_periph) |= CAN_CTL0_SRDIS;
            }
            /* enable local arbitration priority */
            if((uint8_t)ENABLE == can_parameter_init->local_priority_enable) {
                CAN_CTL0(can_periph) |= CAN_CTL0_LAPRIOEN;
            }
            /* set rx private filters and mailbox queue */
            if((uint8_t)ENABLE == can_parameter_init->rx_private_filter_queue_enable) {
                CAN_CTL0(can_periph) |= CAN_CTL0_RPFQEN;
            }
            /* configure edge filtering */
            if((uint32_t)DISABLE == can_parameter_init->edge_filter_enable) {
                CAN_CTL2(can_periph) |= CAN_CTL2_EFDIS;
            }
            /* configure protocol exception */
            if((uint32_t)ENABLE == can_parameter_init->protocol_exception_enable) {
                CAN_CTL2(can_periph) |= CAN_CTL2_PREEN;
            }
            /* set mailbox stop transmission */
            if((uint8_t)ENABLE == can_parameter_init->mb_tx_abort_enable) {
                CAN_CTL0(can_periph) |= CAN_CTL0_MST;
            }

            /* set internal counter source */
            CAN_CTL2(can_periph) |= can_parameter_init->internal_counter_source & CAN_CTL2_ITSRC;
            /* set mailbox arbitration process order */
            CAN_CTL1(can_periph) |= can_parameter_init->mb_tx_order & CAN_CTL1_MTO;
            /* set IDE and RTR field filter type */
            CAN_CTL2(can_periph) |= can_parameter_init->mb_rx_ide_rtr_type & CAN_CTL2_IDERTR_RMF;
            /* configure remote request frame */
            CAN_CTL2(can_periph) |= can_parameter_init->mb_remote_frame & CAN_CTL2_RRFRMS;
            /* set mailbox public filter */
            CAN_RMPUBF(can_periph) = can_parameter_init->mb_public_filter;
            /* configure receive filter order */
            CAN_CTL2(can_periph) |= can_parameter_init->rx_filter_order & CAN_CTL2_RFO;
            /* set memory size */
            CAN_CTL0(can_periph) |= can_parameter_init->memory_size & CAN_CTL0_MSZ;
            /* set time segment */
            CAN_BT(can_periph) |= (uint32_t)(BT_BAUDPSC(can_parameter_init->prescaler - 1U) |
                                             BT_SJW((uint32_t)can_parameter_init->resync_jump_width - 1U) |
                                             BT_PTS((uint32_t)can_parameter_init->prop_time_segment - 1U) |
                                             BT_PBS1((uint32_t)can_parameter_init->time_segment_1 - 1U) |
                                             BT_PBS2((uint32_t)can_parameter_init->time_segment_2 - 1U));
            status = SUCCESS;
        }
    }
    return status;
}

/*!
    \brief      initialize CAN parameter structure with a default value (API_ID:0x0004U)
    \param[in]  type: the type of CAN parameter struct
                only one parameter can be selected which is shown as below:
      \arg        CAN_INIT_STRUCT: the CAN initial struct
      \arg        CAN_FD_INIT_STRUCT: the CAN FD initial struct
      \arg        CAN_FIFO_INIT_STRUCT: the CAN FIFO initial struct
      \arg        CAN_PN_MODE_INIT_STRUCT: the CAN Pretended Networking mode initial struct
      \arg        CAN_PN_MODE_FILTER_STRUCT: the CAN Pretended Networking mode filter struct
      \arg        CAN_MDSC_STRUCT: mailbox descriptor strcut
      \arg        CAN_FDES_STRUCT: Rx fifo descriptor strcut
      \arg        CAN_FIFO_ID_FILTER_STRUCT: Rx fifo id filter strcut
      \arg        CAN_CRC_STRUCT: CRC strcut
      \arg        CAN_ERRCNT_STRUCT: error counter strcut
    \param[in]  p_struct: the pointer of the specific struct
    \param[out] none
    \retval     none
*/
void can_struct_para_init(can_struct_type_enum type, void *p_struct)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_VALID_POINTER(p_struct)) {
        fw_debug_report_err(CAN_MODULE_ID, API_ID(0x0004U), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* get type of the struct */
        switch(type) {
        /* used for initialize can_parameter_struct */
        case CAN_INIT_STRUCT:
            ((can_parameter_struct *)p_struct)->self_reception = (uint8_t)DISABLE;
            ((can_parameter_struct *)p_struct)->internal_counter_source = CAN_TIMER_SOURCE_BIT_CLOCK;
            ((can_parameter_struct *)p_struct)->mb_tx_order = CAN_TX_HIGH_PRIORITY_MB_FIRST;
            ((can_parameter_struct *)p_struct)->mb_tx_abort_enable = (uint8_t)ENABLE;
            ((can_parameter_struct *)p_struct)->local_priority_enable = (uint8_t)DISABLE;
            ((can_parameter_struct *)p_struct)->mb_rx_ide_rtr_type = CAN_IDE_RTR_COMPARED;
            ((can_parameter_struct *)p_struct)->mb_remote_frame = CAN_STORE_REMOTE_REQUEST_FRAME;
            ((can_parameter_struct *)p_struct)->rx_private_filter_queue_enable = (uint8_t)DISABLE;
            ((can_parameter_struct *)p_struct)->edge_filter_enable = (uint32_t)DISABLE;
            ((can_parameter_struct *)p_struct)->protocol_exception_enable = (uint32_t)DISABLE;
            ((can_parameter_struct *)p_struct)->rx_filter_order = CAN_RX_FILTER_ORDER_FIFO_FIRST;
            ((can_parameter_struct *)p_struct)->memory_size = CAN_MEMSIZE_32_UNIT;
            ((can_parameter_struct *)p_struct)->mb_public_filter = 0xFFFFFFFFU;
            ((can_parameter_struct *)p_struct)->prescaler = 0x00000001U;
            ((can_parameter_struct *)p_struct)->resync_jump_width = 0x01U;
            ((can_parameter_struct *)p_struct)->prop_time_segment = 0x01U;
            ((can_parameter_struct *)p_struct)->time_segment_1 = 0x01U;
            ((can_parameter_struct *)p_struct)->time_segment_2 = 0x01U;
            break;
        /* used for initialize can_fd_parameter_struct */
        case CAN_FD_INIT_STRUCT:
            ((can_fd_parameter_struct *)p_struct)->iso_can_fd_enable = (uint32_t)DISABLE;
            ((can_fd_parameter_struct *)p_struct)->bitrate_switch_enable = (uint32_t)ENABLE;
            ((can_fd_parameter_struct *)p_struct)->mailbox_data_size = CAN_MAILBOX_DATA_SIZE_8_BYTES;
            ((can_fd_parameter_struct *)p_struct)->tdc_enable = (uint32_t)DISABLE;
            ((can_fd_parameter_struct *)p_struct)->tdc_offset = 0x00U;
            ((can_fd_parameter_struct *)p_struct)->prescaler = 0x00000001U;
            ((can_fd_parameter_struct *)p_struct)->resync_jump_width = 0x01U;
            ((can_fd_parameter_struct *)p_struct)->prop_time_segment = 0x00U;
            ((can_fd_parameter_struct *)p_struct)->time_segment_1 = 0x01U;
            ((can_fd_parameter_struct *)p_struct)->time_segment_2 = 0x01U;
            break;
        /* used for initialize can_fifo_parameter_struct */
        case CAN_FIFO_INIT_STRUCT:
            ((can_fifo_parameter_struct *)p_struct)->dma_enable = (uint8_t)DISABLE;
            ((can_fifo_parameter_struct *)p_struct)->filter_format_and_number = CAN_RXFIFO_FILTER_A_NUM_8;
            ((can_fifo_parameter_struct *)p_struct)->fifo_public_filter = 0xFFFFFFFFU;
            break;
        /* used for initialize can_pn_mode_config_struct */
        case CAN_PN_MODE_INIT_STRUCT:
            ((can_pn_mode_config_struct *)p_struct)->timeout_int = (uint32_t)DISABLE;
            ((can_pn_mode_config_struct *)p_struct)->match_int = (uint32_t)DISABLE;
            ((can_pn_mode_config_struct *)p_struct)->num_matches = 0x01U;
            ((can_pn_mode_config_struct *)p_struct)->match_timeout = 0x0000U;
            ((can_pn_mode_config_struct *)p_struct)->frame_filter = CAN_PN_FRAME_FILTERING_ID;
            ((can_pn_mode_config_struct *)p_struct)->id_filter = CAN_PN_ID_FILTERING_EXACT;
            ((can_pn_mode_config_struct *)p_struct)->data_filter = CAN_PN_DATA_FILTERING_EXACT;
            break;
        /* used for initialize can_pn_mode_filter_struct */
        case CAN_PN_MODE_FILTER_STRUCT:
            ((can_pn_mode_filter_struct *)p_struct)->rtr = (uint32_t)RESET;
            ((can_pn_mode_filter_struct *)p_struct)->ide = (uint32_t)RESET;
            ((can_pn_mode_filter_struct *)p_struct)->id = 0x00000000U;
            ((can_pn_mode_filter_struct *)p_struct)->dlc_high_threshold = 0x00000000U;
            ((can_pn_mode_filter_struct *)p_struct)->dlc_low_threshold = 0x00000000U;
            ((can_pn_mode_filter_struct *)p_struct)->payload[0] = 0x00000000U;
            ((can_pn_mode_filter_struct *)p_struct)->payload[1] = 0x00000000U;
            break;
        /* used for initialize can_mailbox_descriptor_struct */
        case CAN_MDSC_STRUCT:
            ((can_mailbox_descriptor_struct *)p_struct)->timestamp = 0x00000000U;
            ((can_mailbox_descriptor_struct *)p_struct)->dlc = 0x00000000U;
            ((can_mailbox_descriptor_struct *)p_struct)->rtr = 0x00000000U;
            ((can_mailbox_descriptor_struct *)p_struct)->ide = 0x00000000U;
            ((can_mailbox_descriptor_struct *)p_struct)->srr = 0x00000000U;
            ((can_mailbox_descriptor_struct *)p_struct)->reserve1 = 0x00000000U;
            ((can_mailbox_descriptor_struct *)p_struct)->code = 0x00000000U;
            ((can_mailbox_descriptor_struct *)p_struct)->reserve2 = 0x00000000U;
            ((can_mailbox_descriptor_struct *)p_struct)->esi = 0x00000000U;
            ((can_mailbox_descriptor_struct *)p_struct)->brs = 0x00000000U;
            ((can_mailbox_descriptor_struct *)p_struct)->fdf = 0x00000000U;
            ((can_mailbox_descriptor_struct *)p_struct)->id = 0x00000000U;
            ((can_mailbox_descriptor_struct *)p_struct)->prio = 0x00000000U;
            ((can_mailbox_descriptor_struct *)p_struct)->data_bytes = 0x00000000U;
            ((can_mailbox_descriptor_struct *)p_struct)->padding = 0x0000U;
            break;
        /* used for initialize can_rx_fifo_struct */
        case CAN_FDES_STRUCT:
            ((can_rx_fifo_struct *)p_struct)->timestamp = 0x00000000U;
            ((can_rx_fifo_struct *)p_struct)->dlc = 0x00000000U;
            ((can_rx_fifo_struct *)p_struct)->rtr = 0x00000000U;
            ((can_rx_fifo_struct *)p_struct)->ide = 0x00000000U;
            ((can_rx_fifo_struct *)p_struct)->srr = 0x00000000U;
            ((can_rx_fifo_struct *)p_struct)->idhit = 0x00000000U;
            ((can_rx_fifo_struct *)p_struct)->id = 0x00000000U;
            ((can_rx_fifo_struct *)p_struct)->data[0] = 0x00000000U;
            ((can_rx_fifo_struct *)p_struct)->data[1] = 0x00000000U;
            break;
        /* used for initialize can_rx_fifo_id_filter_struct */
        case CAN_FIFO_ID_FILTER_STRUCT:
            ((can_rx_fifo_id_filter_struct *)p_struct)->remote_frame = 0x00000000U;
            ((can_rx_fifo_id_filter_struct *)p_struct)->extended_frame = 0x00000000U;
            ((can_rx_fifo_id_filter_struct *)p_struct)->id = 0x00000000U;
            break;
        /* used for initialize can_crc_struct */
        case CAN_CRC_STRUCT:
            ((can_crc_struct *)p_struct)->classical_frm_mb_number = 0x00000000U;
            ((can_crc_struct *)p_struct)->classical_frm_transmitted_crc = 0x00000000U;
            ((can_crc_struct *)p_struct)->classical_fd_frm_mb_number = 0x00000000U;
            ((can_crc_struct *)p_struct)->classical_fd_frm_transmitted_crc = 0x00000000U;
            break;
        /* used for initialize can_crc_struct */
        case CAN_ERRCNT_STRUCT:
            ((can_error_counter_struct *)p_struct)->fd_data_phase_rx_errcnt = 0x00U;
            ((can_error_counter_struct *)p_struct)->fd_data_phase_tx_errcnt = 0x00U;
            ((can_error_counter_struct *)p_struct)->rx_errcnt = 0x00U;
            ((can_error_counter_struct *)p_struct)->tx_errcnt = 0x00U;
            break;
        default:
            break;
        }
    }
}

/*!
    \brief      configure receive fifo/mailbox private filter (API_ID:0x0005U)
    \param[in]  can_periph: CANx(x=0,1,2)
    \param[in]  index: mailbox index: 0~31
    \param[in]  filter_data: filter data to configure
    \param[out] none
    \retval     none
*/
void can_private_filter_config(uint32_t can_periph, uint32_t index, uint32_t filter_data)
{
    CAN_RFIFOMPF(can_periph, index) = filter_data;
}

/*!
    \brief      enter the corresponding mode (API_ID:0x0006U)
    \param[in]  can_periph: CANx(x=0,1,2)
    \param[in]  mode: the mode to enter
                only one parameter can be selected which is shown as below:
      \arg        CAN_NORMAL_MODE: normal mode
      \arg        CAN_MONITOR_MODE: monitor mode
      \arg        CAN_LOOPBACK_SILENT_MODE: loopback mode
      \arg        CAN_INACTIVE_MODE: inactive mode
      \arg        CAN_DISABLE_MODE: disable mode
      \arg        CAN_PN_MODE: Pretended Networking mode
    \param[out] none
    \retval     ERROR or SUCCESS
    \note       This function contains scenarios leading to an infinite loop.
                Modify according to the user's actual usage scenarios.
*/
ErrStatus can_operation_mode_enter(uint32_t can_periph, can_operation_modes_enum mode)
{
    uint32_t timeout;
    ErrStatus status = SUCCESS;

    /* enter INACTIVE mode */
    /* exit can_disable mode */
    CAN_CTL0(can_periph) &= ~CAN_CTL0_CANDIS;
    /* enter inactive mode */
    CAN_CTL0(can_periph) |= CAN_CTL0_HALT | CAN_CTL0_INAMOD;
    /* exit Pretended Networking mode */
    CAN_CTL0(can_periph) &= ~(CAN_CTL0_PNEN | CAN_CTL0_PNMOD);
    timeout = CAN_DELAY;
    /* wait for inactive mode state */
    while(((CAN_CTL0_NRDY | CAN_CTL0_INAS) != (CAN_CTL0(can_periph) & (CAN_CTL0_NRDY | CAN_CTL0_INAS))) && (timeout)) {
        timeout--;
    }
    if((CAN_CTL0_NRDY | CAN_CTL0_INAS) != (CAN_CTL0(can_periph) & (CAN_CTL0_NRDY | CAN_CTL0_INAS))) {
        status = ERROR;
    } else {
        /* configure the modes */
        switch(mode) {
        case CAN_NORMAL_MODE:
            CAN_CTL1(can_periph) &= ~(CAN_CTL1_LSCMOD | CAN_CTL1_MMOD);
            break;
        case CAN_MONITOR_MODE:
            CAN_CTL1(can_periph) &= ~CAN_CTL1_LSCMOD;
            CAN_CTL1(can_periph) |= CAN_CTL1_MMOD;
            break;
        case CAN_LOOPBACK_SILENT_MODE:
            CAN_CTL1(can_periph) &= ~CAN_CTL1_MMOD;
            CAN_CTL0(can_periph) &= ~CAN_CTL0_SRDIS;
            CAN_FDCTL(can_periph) &= ~CAN_FDCTL_TDCEN;
            CAN_CTL1(can_periph) |= CAN_CTL1_LSCMOD;
            break;
        case CAN_INACTIVE_MODE:
            break;
        case CAN_DISABLE_MODE:
            CAN_CTL0(can_periph) |= CAN_CTL0_CANDIS;
            break;
        case CAN_PN_MODE:
            CAN_CTL0(can_periph) |= (CAN_CTL0_PNEN | CAN_CTL0_PNMOD);
            break;
        default:
            break;
        }

        /* exit INACTIVE mode */
        if(CAN_INACTIVE_MODE != mode) {
            /* exit inactive mode */
            CAN_CTL0(can_periph) &= ~(CAN_CTL0_HALT | CAN_CTL0_INAMOD);
            timeout = CAN_DELAY;
            while((CAN_CTL0(can_periph) & CAN_CTL0_INAS) && (timeout)) {
                timeout--;
            }
            if(CAN_CTL0(can_periph) & CAN_CTL0_INAS) {
                status = ERROR;
            }
        }
        if(SUCCESS == status) {
            if(CAN_PN_MODE == mode) {
                timeout = CAN_DELAY;
                while((0U == (CAN_CTL0(can_periph) & CAN_CTL0_PNS)) && (timeout)) {
                    timeout--;
                }
                if(0U == (CAN_CTL0(can_periph) & CAN_CTL0_PNS)) {
                    status = ERROR;
                }
            }
        }
    }
    return status;
}

/*!
    \brief      get operation mode (API_ID:0x0007U)
    \param[in]  can_periph: CANx(x=0,1,2)
    \param[out] none
    \retval     can_operation_modes_enum
*/
can_operation_modes_enum can_operation_mode_get(uint32_t can_periph)
{
    uint32_t reg;
    can_operation_modes_enum state = CAN_NORMAL_MODE;

