RT-Thread-packages/gd32-arm-series/GD32H77x_78x/GD32H77x_78x_standard_peripheral/Source/gd32h77x_78x_can.c
    reg = CAN_CTL0(can_periph);
    reg &= (CAN_CTL0_NRDY | CAN_CTL0_INAS | CAN_CTL0_PNS | CAN_CTL0_LPS);

    if((CAN_CTL0_NRDY | CAN_CTL0_LPS) == reg) {
        state = CAN_DISABLE_MODE;
    } else if((CAN_CTL0_NRDY | CAN_CTL0_INAS) == reg) {
        state = CAN_INACTIVE_MODE;
    } else if(0U == reg) {
        if(CAN_CTL1(can_periph)&CAN_CTL1_MMOD) {
            state = CAN_MONITOR_MODE;
        } else if(CAN_CTL1(can_periph)&CAN_CTL1_LSCMOD) {
            state = CAN_LOOPBACK_SILENT_MODE;
        } else {
            state = CAN_NORMAL_MODE;
        }
    } else if(CAN_CTL0_PNS == reg) {
        state = CAN_PN_MODE;
    } else {
        /* should not get here */
    }
    return state;
}

/*!
    \brief      exit inactive mode (API_ID:0x0008U)
    \param[in]  can_periph: CANx(x=0,1,2)
    \param[out] none
    \retval     ERROR or SUCCESS
    \note       This function contains scenarios leading to an infinite loop.
                Modify according to the user's actual usage scenarios.
*/
ErrStatus can_inactive_mode_exit(uint32_t can_periph)
{
    ErrStatus status;
    uint32_t timeout;

    /* exit inactive mode */
    CAN_CTL0(can_periph) &= ~CAN_CTL0_HALT;
    timeout = CAN_DELAY;
    while((CAN_CTL0(can_periph) & CAN_CTL0_INAS) && (timeout)) {
        timeout--;
    }
    if(CAN_CTL0(can_periph) & CAN_CTL0_INAS) {
        status = ERROR;
    } else {
        status = SUCCESS;
    }
    return status;
}

/*!
    \brief      exit Pretended Networking mode (API_ID:0x0009U)
    \param[in]  can_periph: CANx(x=0,1,2)
    \param[out] none
    \retval     ERROR or SUCCESS
    \note       This function contains scenarios leading to an infinite loop.
                Modify according to the user's actual usage scenarios.
*/
ErrStatus can_pn_mode_exit(uint32_t can_periph)
{
    ErrStatus status;
    uint32_t timeout;

    CAN_CTL0(can_periph) &= ~(CAN_CTL0_PNEN | CAN_CTL0_PNMOD);
    timeout = CAN_DELAY;
    while((CAN_CTL0(can_periph) & CAN_CTL0_PNS) && (timeout)) {
        timeout--;
    }
    if(CAN_CTL0(can_periph) & CAN_CTL0_PNS) {
        status = ERROR;
    } else {
        status = SUCCESS;
    }

    return status;
}

/*!
    \brief      can FD initialize (API_ID:0x000AU)
    \param[in]  can_periph: CANx(x=0,1,2)
    \param[in]  can_fd_para_init: can fd parameter struct
                  iso_can_fd_enable: ENABLE, DISABLE
                  bitrate_switch_enable: ENABLE, DISABLE
                  mailbox_data_size: CAN_MAILBOX_DATA_SIZE_8_BYTES, CAN_MAILBOX_DATA_SIZE_16_BYTES,
                                     CAN_MAILBOX_DATA_SIZE_32_BYTES, CAN_MAILBOX_DATA_SIZE_64_BYTES
                  tdc_enable: ENABLE, DISABLE
                  tdc_offset: 0 ~ 255
                  prescaler: 1~1024
                  resync_jump_width: 1~16
                  prop_time_segment: 0~63
                  time_segment_1: 1~32
                  time_segment_2: 2~32
    \param[out] none
    \retval     none
*/
void can_fd_config(uint32_t can_periph, can_fd_parameter_struct *can_fd_para_init)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_VALID_POINTER(can_fd_para_init)) {
        fw_debug_report_err(CAN_MODULE_ID, API_ID(0x000AU), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* clear register bits, then enable FD mode */
        CAN_CTL0(can_periph) &= ~CAN_CTL0_RFEN;
        CAN_CTL1(can_periph) &= ~CAN_CTL1_BSPMOD;
        CAN_CTL2(can_periph) &= ~CAN_CTL2_ISO;
        CAN_FDCTL(can_periph) &= ~(CAN_FDCTL_BRSEN | CAN_FDCTL_MDSZ | CAN_FDCTL_TDCEN | CAN_FDCTL_TDCO);
        CAN_FDBT(can_periph) &= ~(CAN_FDBT_DBAUDPSC | CAN_FDBT_DSJW | CAN_FDBT_DPTS | CAN_FDBT_DPBS1 | CAN_FDBT_DPBS2);
        CAN_CTL0(can_periph) |= CAN_CTL0_FDEN;

        /* support ISO or non-ISO mode */
        if((uint32_t)ENABLE == can_fd_para_init->iso_can_fd_enable) {
            CAN_CTL2(can_periph) |= CAN_CTL2_ISO;
        }
        /* set TDC parameter */
        if((uint32_t)ENABLE == can_fd_para_init->tdc_enable) {
            CAN_FDCTL(can_periph) |= CAN_FDCTL_TDCEN;
        }
        /* set data bit rate */
        if((uint32_t)ENABLE == can_fd_para_init->bitrate_switch_enable) {
            CAN_FDCTL(can_periph) |= CAN_FDCTL_BRSEN;
        }

        /* set mailbox data size */
        CAN_FDCTL(can_periph) |= can_fd_para_init->mailbox_data_size;
        /* configure FD bit timing */
        CAN_FDBT(can_periph) |= (uint32_t)(FDBT_DBAUDPSC(can_fd_para_init->prescaler - 1U) |
                                           FDBT_DSJW((uint32_t)can_fd_para_init->resync_jump_width - 1U) |
                                           FDBT_DPTS(can_fd_para_init->prop_time_segment) |
                                           FDBT_DPBS1((uint32_t)can_fd_para_init->time_segment_1 - 1U) |
                                           FDBT_DPBS2((uint32_t)can_fd_para_init->time_segment_2 - 1U));
        /* configure transmitter delay compensation offset */
        CAN_FDCTL(can_periph) |= FDCTL_TDCO(can_fd_para_init->tdc_offset);
    }
}

/*!
    \brief      enable bit rate switching (API_ID:0x000BU)
    \param[in]  can_periph: CANx(x=0,1,2)
    \param[out] none
    \retval     none
*/
void can_bitrate_switch_enable(uint32_t can_periph)
{
    CAN_FDCTL(can_periph) |= CAN_FDCTL_BRSEN;
}

/*!
    \brief      disable bit rate switching (API_ID:0x000CU)
    \param[in]  can_periph: CANx(x=0,1,2)
    \param[out] none
    \retval     none
*/
void can_bitrate_switch_disable(uint32_t can_periph)
{
    CAN_FDCTL(can_periph) &= ~CAN_FDCTL_BRSEN;
}

/*!
    \brief      get transmitter delay compensation value (API_ID:0x000DU)
    \param[in]  can_periph: CANx(x=0,1,2)
    \param[out] none
    \retval     0 - 0xFF
*/
uint32_t can_tdc_get(uint32_t can_periph)
{
    uint32_t reg;

    reg = CAN_FDCTL(can_periph);
    return GET_FDCTL_TDCV(reg);
}

/*!
    \brief      enable transmitter delay compensation (API_ID:0x000EU)
    \param[in]  can_periph: CANx(x=0,1,2)
    \param[out] none
    \retval     none
*/
void can_tdc_enable(uint32_t can_periph)
{
    CAN_FDCTL(can_periph) |= CAN_FDCTL_TDCEN;
}

/*!
    \brief      disable transmitter delay compensation (API_ID:0x000FU)
    \param[in]  can_periph: CANx(x=0,1,2)
    \param[out] none
    \retval     none
*/
void can_tdc_disable(uint32_t can_periph)
{
    CAN_FDCTL(can_periph) &= ~CAN_FDCTL_TDCEN;
}

/*!
    \brief      configure rx FIFO (API_ID:0x00010U)
    \param[in]  can_periph: CANx(x=0,1,2)
    \param[in]  can_fifo_para_init: fifo parameter struct
                  dma_enable: ENABLE, DISABLE
                  filter_format_and_number: CAN_RXFIFO_FILTER_A_NUM_8, CAN_RXFIFO_FILTER_A_NUM_16, CAN_RXFIFO_FILTER_A_NUM_24, CAN_RXFIFO_FILTER_A_NUM_32,
                                            CAN_RXFIFO_FILTER_A_NUM_40, CAN_RXFIFO_FILTER_A_NUM_48, CAN_RXFIFO_FILTER_A_NUM_56, CAN_RXFIFO_FILTER_A_NUM_64,
                                            CAN_RXFIFO_FILTER_A_NUM_72, CAN_RXFIFO_FILTER_A_NUM_80, CAN_RXFIFO_FILTER_A_NUM_88, CAN_RXFIFO_FILTER_A_NUM_96, CAN_RXFIFO_FILTER_A_NUM_104,
                                            CAN_RXFIFO_FILTER_B_NUM_16, CAN_RXFIFO_FILTER_B_NUM_32, CAN_RXFIFO_FILTER_B_NUM_48, CAN_RXFIFO_FILTER_B_NUM_64,
                                            CAN_RXFIFO_FILTER_B_NUM_80, CAN_RXFIFO_FILTER_B_NUM_96, CAN_RXFIFO_FILTER_B_NUM_112, CAN_RXFIFO_FILTER_B_NUM_128,
                                            CAN_RXFIFO_FILTER_B_NUM_144, CAN_RXFIFO_FILTER_B_NUM_160, CAN_RXFIFO_FILTER_B_NUM_176, CAN_RXFIFO_FILTER_B_NUM_192, CAN_RXFIFO_FILTER_B_NUM_208,
                                            CAN_RXFIFO_FILTER_C_NUM_32, CAN_RXFIFO_FILTER_C_NUM_64, CAN_RXFIFO_FILTER_C_NUM_96, CAN_RXFIFO_FILTER_C_NUM_128,
                                            CAN_RXFIFO_FILTER_C_NUM_160, CAN_RXFIFO_FILTER_C_NUM_192, CAN_RXFIFO_FILTER_C_NUM_224, CAN_RXFIFO_FILTER_C_NUM_256,
                                            CAN_RXFIFO_FILTER_C_NUM_288, CAN_RXFIFO_FILTER_C_NUM_320, CAN_RXFIFO_FILTER_C_NUM_352, CAN_RXFIFO_FILTER_C_NUM_384, CAN_RXFIFO_FILTER_C_NUM_416,
                                            CAN_RXFIFO_FILTER_D
                  fifo_public_filter: 0x00000000 ~ 0xFFFFFFFF
    \param[out] none
    \retval     none
*/
void can_rx_fifo_config(uint32_t can_periph, can_fifo_parameter_struct *can_fifo_para_init)
{
    uint32_t num;
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_VALID_POINTER(can_fifo_para_init)) {
        fw_debug_report_err(CAN_MODULE_ID, API_ID(0x0010U), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* clear register bits, disable FD mode, then enable rx FIFO mode */
        CAN_CTL0(can_periph) &= ~(CAN_CTL0_FDEN | CAN_CTL0_DMAEN | CAN_CTL0_FS);
        CAN_CTL2(can_periph) &= ~CAN_CTL2_RFFN;
        CAN_CTL0(can_periph) |= CAN_CTL0_RFEN;

