RT-Thread-packages/gd32-arm-series/GD32H77x_78x/GD32H77x_78x_standard_peripheral/Source/gd32h77x_78x_can.c
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_VALID_POINTER(errcnt_struct)) {
        fw_debug_report_err(CAN_MODULE_ID, API_ID(0x001FU), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        reg = CAN_ERR0(can_periph);
        errcnt_struct->fd_data_phase_rx_errcnt = (uint8_t)GET_ERR0_REFCNT(reg);
        errcnt_struct->fd_data_phase_tx_errcnt = (uint8_t)GET_ERR0_TEFCNT(reg);
        errcnt_struct->rx_errcnt = (uint8_t)GET_ERR0_RECNT(reg);
        errcnt_struct->tx_errcnt = (uint8_t)GET_ERR0_TECNT(reg);
    }
}

/*!
    \brief      get error state indicator (API_ID:0x0020U)
    \param[in]  can_periph: CANx(x=0,1,2)
    \param[out] none
    \retval     CAN_ERROR_STATE_ACTIVE, CAN_ERROR_STATE_PASSIVE or CAN_ERROR_STATE_BUS_OFF
*/
can_error_state_enum can_error_state_get(uint32_t can_periph)
{
    uint32_t reg;

    reg = GET_ERR1_ERRSI(CAN_ERR1(can_periph));
    if(reg >= (uint32_t)CAN_ERROR_STATE_BUS_OFF) {
        reg = (uint32_t)CAN_ERROR_STATE_BUS_OFF;
    }

    return (can_error_state_enum)reg;
}

/*!
    \brief      get mailbox CRC value (API_ID:0x0021U)
    \param[in]  can_periph: CANx(x=0,1,2)
    \param[out] crc_struct:
                  classical_frm_mb_number: 0 - 0x1F
                  classical_frm_transmitted_crc: 0 - 0x7FFF
                  classical_fd_frm_mb_number: 0 - 0x1F
                  classical_fd_frm_transmitted_crc: 0 - 0x1FFFFF
    \retval     none
*/
void can_crc_get(uint32_t can_periph, can_crc_struct *crc_struct)
{
    uint32_t reg1, reg2;
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_VALID_POINTER(crc_struct)) {
        fw_debug_report_err(CAN_MODULE_ID, API_ID(0x0021U), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        reg1 = CAN_CRCC(can_periph);
        reg2 = CAN_CRCCFD(can_periph);
        crc_struct->classical_frm_mb_number = GET_CRCC_ANTM(reg1);
        crc_struct->classical_frm_transmitted_crc = GET_CRCC_CRCTC(reg1);
        crc_struct->classical_fd_frm_mb_number = GET_CRCCFD_ANTM(reg2);
        crc_struct->classical_fd_frm_transmitted_crc = GET_CRCCFD_CRCTCI(reg2);
    }
}

/*!
    \brief      configure Pretended Networking mode parameter (API_ID:0x0022U)
    \param[in]  can_periph: CANx(x=0,1,2)
    \param[in]  pnmod_config: Pretended Networking mode config struct
                  timeout_int: ENABLE, DISABLE
                  match_int: ENABLE, DISABLE
                  num_matches: 1 ~ 255
                  match_timeout: 0 ~ 0xFFFF
                  frame_filter: CAN_PN_FRAME_FILTERING_ID, CAN_PN_FRAME_FILTERING_ID_DATA
                                CAN_PN_FRAME_FILTERING_ID_NMM, CAN_PN_FRAME_FILTERING_ID_DATA_NMM
                  id_filter: CAN_PN_ID_FILTERING_EXACT, CAN_PN_ID_FILTERING_GREATER
                             CAN_PN_ID_FILTERING_SMALLER, CAN_PN_ID_FILTERING_RANGE
                  data_filter: CAN_PN_DATA_FILTERING_EXACT, CAN_PN_DATA_FILTERING_GREATER
                               CAN_PN_DATA_FILTERING_SMALLER, CAN_PN_DATA_FILTERING_RANGE
    \param[out] none
    \retval     none
*/
void can_pn_mode_config(uint32_t can_periph, can_pn_mode_config_struct *pnmod_config)
{
    uint32_t tmp;
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_VALID_POINTER(pnmod_config)) {
        fw_debug_report_err(CAN_MODULE_ID, API_ID(0x0022U), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* configure specific Pretended Networking mode settings */
        tmp = CAN_PN_CTL0(can_periph);
        tmp &= ~(CAN_PN_CTL0_FFT | CAN_PN_CTL0_IDFT | CAN_PN_CTL0_DATAFT |
                 CAN_PN_CTL0_NMM | CAN_PN_CTL0_WMIE | CAN_PN_CTL0_WTOIE);
        tmp |= (uint32_t)PN_CTL0_WTOIE(pnmod_config->timeout_int) | PN_CTL0_WMIE(pnmod_config->match_int) | \
               PN_CTL0_NMM(pnmod_config->num_matches) | pnmod_config->data_filter | \
               pnmod_config->id_filter | pnmod_config->frame_filter;

        CAN_PN_CTL0(can_periph) = tmp;

        /* set timeout value */
        CAN_PN_TO(can_periph) &= ~CAN_PN_TO_WTO;
        CAN_PN_TO(can_periph) |= (uint32_t)PN_TO_WTO(pnmod_config->match_timeout);

        /* enable Pretended Networking mode */
        CAN_CTL0(can_periph) |= CAN_CTL0_PNMOD;
    }
}

/*!
    \brief      configure Pretended Networking mode filter (API_ID:0x0023U)
    \param[in]  can_periph: CANx(x=0,1,2)
    \param[in]  expect: Pretended Networking mode struct of expected wakeup frame
                  rtr: SET, RESET
                  ide: SET, RESET
                  id: 0~0x7FF | CAN_STANDARD, or 0~0x1FFFFFFF | CAN_EXTENDED
                  dlc_high_threshold: 0~8
                  dlc_low_threshold: 0~8
                  payload[0]: 0x00000000~0xFFFFFFFF
                  payload[1]: 0x00000000~0xFFFFFFFF
    \param[in]  filter: Pretended Networking mode struct of filter data
                  remote_frame: SET, RESET
                  extended_frame: SET, RESET
                  id: 0~0x7FF | CAN_STANDARD, or 0~0x1FFFFFFF | CAN_EXTENDED. Used as id filter data, or id expected high threshold.
                  payload[0]: 0x00000000~0xFFFFFFFF. Used as payload filter data, or payload expected high threshold.
                  payload[1]: 0x00000000~0xFFFFFFFF. Used as payload filter data, or payload expected high threshold.
    \param[out] none
    \retval     none
*/
void can_pn_mode_filter_config(uint32_t can_periph, can_pn_mode_filter_struct *expect, can_pn_mode_filter_struct *filter)
{
    uint32_t reg, temp;
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_VALID_POINTER(expect)) {
        fw_debug_report_err(CAN_MODULE_ID, API_ID(0x0023U), ERR_PARAM_POINTER);
    } else if(NOT_VALID_POINTER(filter)) {
        fw_debug_report_err(CAN_MODULE_ID, API_ID(0x0023U), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* set filter identifier 0 */
        reg = 0U;
        if((uint32_t)SET == expect->ide) {
            reg |= CAN_PN_EID0_EIDE;
        }
        if((uint32_t)SET == expect->rtr) {
            reg |= CAN_PN_EID0_ERTR;
        }
        if(CAN_STANDARD == (expect->id & BIT(31))) {
            reg |= (uint32_t)PN_EID0_EIDF_ELT_STD(expect->id);
        } else {
            reg |= (uint32_t)PN_EID0_EIDF_ELT_EXD(expect->id);
        }

        CAN_PN_EID0(can_periph) = reg;

        temp = CAN_PN_CTL0(can_periph);
        reg = 0U;
        /* ID field 1 is used when ID filtering type is EXACT or RANGE */
        if(((temp & CAN_PN_CTL0_IDFT) == CAN_PN_ID_FILTERING_EXACT) || ((temp & CAN_PN_CTL0_IDFT) == CAN_PN_ID_FILTERING_RANGE)) {
            if(CAN_STANDARD == (filter->id & BIT(31))) {
                reg |= (uint32_t)PN_IFEID1_IDEFD_STD(filter->id);
            } else {
                reg |= (uint32_t)PN_IFEID1_IDEFD_EXD(filter->id);
            }
        }
        if((uint32_t)SET == filter->ide) {
            reg |= CAN_PN_IFEID1_IDEFD;
        }
        if((uint32_t)SET == filter->rtr) {
            reg |= CAN_PN_IFEID1_RTRFD;
        }
        /* set filter identifier 1 */
        CAN_PN_IFEID1(can_periph) = reg;

        /* data field is used when frame filtering type is not MATCH or MATCH NMM */
        if(((temp & CAN_PN_CTL0_FFT) == CAN_PN_FRAME_FILTERING_ID_DATA) ||
                ((temp & CAN_PN_CTL0_FFT) == CAN_PN_FRAME_FILTERING_ID_DATA_NMM)) {
            /* set filter data payload 0 */
            CAN_PN_EDLC(can_periph) = PN_EDLC_DLCEHT(expect->dlc_high_threshold) | PN_EDLC_DLCELT(expect->dlc_low_threshold);
            CAN_PN_EDL0(can_periph) = ((expect->payload[0] << 24U) & CAN_PN_EDL0_DB0ELT) |
                                      ((expect->payload[0] << 8U) & CAN_PN_EDL0_DB1ELT) |
                                      ((expect->payload[0] >> 8U) & CAN_PN_EDL0_DB2ELT) |
                                      ((expect->payload[0] >> 24U) & CAN_PN_EDL0_DB3ELT);
            CAN_PN_EDL1(can_periph) = ((expect->payload[1] << 24U) & CAN_PN_EDL1_DB4ELT) |
                                      ((expect->payload[1] << 8U) & CAN_PN_EDL1_DB5ELT) |
                                      ((expect->payload[1] >> 8U) & CAN_PN_EDL1_DB6ELT) |
                                      ((expect->payload[1] >> 24U) & CAN_PN_EDL1_DB7ELT);

            /* data field 1 is used when data filtering type is EXACT or RANGE */
            if(((temp & CAN_PN_CTL0_DATAFT) == CAN_PN_DATA_FILTERING_EXACT)
                    || ((temp & CAN_PN_CTL0_DATAFT) == CAN_PN_DATA_FILTERING_RANGE)) {
                /* set filter data payload 1 */
                CAN_PN_DF0EDH0(can_periph) = ((filter->payload[0] << 24U) & CAN_PN_DF0EDH0_DB0FD_EHT) |
                                             ((filter->payload[0] << 8U) & CAN_PN_DF0EDH0_DB1FD_EHT) |
                                             ((filter->payload[0] >> 8U) & CAN_PN_DF0EDH0_DB2FD_EHT) |
                                             ((filter->payload[0] >> 24U) & CAN_PN_DF0EDH0_DB3FD_EHT);
                CAN_PN_DF1EDH1(can_periph) = ((filter->payload[1] << 24U) & CAN_PN_DF1EDH1_DB4FD_EHT) |
                                             ((filter->payload[1] << 8U) & CAN_PN_DF1EDH1_DB5FD_EHT) |
                                             ((filter->payload[1] >> 8U) & CAN_PN_DF1EDH1_DB6FD_EHT) |
                                             ((filter->payload[1] >> 24U) & CAN_PN_DF1EDH1_DB7FD_EHT);
            }
        }
    }
}

/*!
    \brief      get matching message counter of Pretended Networking mode (API_ID:0x0024U)
    \param[in]  can_periph: CANx(x=0,1,2)
    \param[out] none
    \retval     0~255 or -1
*/
int32_t can_pn_mode_num_of_match_get(uint32_t can_periph)
{
    int32_t ret = -1;
    uint32_t reg;

